Revit 2027 API
ApplicationEntryPoint.Initialize Method
 For Revit Macros internal use only.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Initialize(
	Object obj,
	string addinFolder
)
Public Sub Initialize (
	obj As Object,
	addinFolder As String
)
public:
virtual void Initialize(
	Object^ obj,
	String^ addinFolder
) sealed
abstract Initialize :
        obj : Object *
        addinFolder : string -> unit
override Initialize :
        obj : Object *
        addinFolder : string -> unit
Parameters
obj Object
addinFolder String
Implements
IEntryPoint.Initialize(Object, String)
See Also
Reference
ApplicationEntryPoint Class
Autodesk.Revit.DB.Macros Namespace